# -*- coding: utf-8 -*-

import requests as rq
from bs4 import BeautifulSoup

cookie = input("请输入你的cookie:\n")

# 八五普法
bawupufa ={ 'objId':'1823271524825571328','bookName':'八五普法导读','chapter_content':[{'id': '1823271524838154240', 'contentId': '1823271524825571328', 'title': '编委会'}, {'id': '1823272237584621568', 'contentId': '1823271524825571328', 'title': '厚植法治沃土 为奋力谱写中国式现代化湖南篇章贡献法治力量'}, {'id': '1823272789445976064', 'contentId': '1823271524825571328', 'title': '第一编习近平法治思想'}, {'id': '1823273812881317888', 'contentId': '1823271524825571328', 'title': '第二编 法治大事记'}, {'id': '1823274048647340032', 'contentId': '1823271524825571328', 'title': '第三编 法律导读'}, {'id': '1823274191127846912', 'contentId': '1823271524825571328', 'title': '第四编 以案释法'}, {'id': '1823274737129758720', 'contentId': '1823271524825571328', 'title': '一、擦亮法治的政治底色'}, {'id': '1823274768058556416', 'contentId': '1823271524825571328', 'title': '二、人民就是江山，江山就是人民'}, {'id': '1823274770222817280', 'contentId': '1823271524825571328', 'title': '三、鞋子合不合脚，自己穿了才知道'}, {'id': '1823274772575821824', 'contentId': '1823271524825571328', 'title': '四、法以强国，宪以载道'}, {'id': '1823274796416245760', 'contentId': '1823271524825571328', 'title': '五、方向决定道路，道路决定命运'}, {'id': '1823274803290710016', 'contentId': '1823271524825571328', 'title': '六、法治兴则国兴，法治强则国强'}, {'id': '1823274805769543680', 'contentId': '1823271524825571328', 'title': '七、在共同推进上着力，在一体建设上用劲'}, {'id': '1823274808193851392', 'contentId': '1823271524825571328', 'title': '八、从“有法可依”走向“良法善治”'}, {'id': '1823274810437804032', 'contentId': '1823271524825571328', 'title': '九、既要立足中国，又要心怀天下'}, {'id': '1823274812593676288', 'contentId': '1823271524825571328', 'title': '十、没有金刚钻，揽不了瓷器活'}, {'id': '1823274814707605504', 'contentId': '1823271524825571328', 'title': '十一、敬一贤则众贤悦，诛一恶则众恶惧'}, {'id': '1823274887168401408', 'contentId': '1823271524825571328', 'title': '一、为“立规矩”而立的“规矩”'}, {'id': '1823274892671328256', 'contentId': '1823271524825571328', 'title': '二、烟花就是人间“烟火”'}, {'id': '1823274894797840384', 'contentId': '1823271524825571328', 'title': '三、给“自己人”派发的“定心丸”'}, {'id': '1823274896865632256', 'contentId': '1823271524825571328', 'title': '四、提升“关键少数”的法律素养是“关键”'}, {'id': '1823274899013115904', 'contentId': '1823271524825571328', 'title': '五、法与时转则治，治与世宜则有功'}, {'id': '1823274900955078656', 'contentId': '1823271524825571328', 'title': '六、根治“无形伤害”的“有形”武器'}, {'id': '1823274903136116736', 'contentId': '1823271524825571328', 'title': '七、让彩礼回归“礼”的司法设计'}, {'id': '1823274905505898496', 'contentId': '1823271524825571328', 'title': '八、为了“餐桌上”和“舌尖上”的安全'}, {'id': '1823274907976343552', 'contentId': '1823271524825571328', 'title': '九、基层社会治理的“样板”和“金名片”'}, {'id': '1823274910748778496', 'contentId': '1823271524825571328', 'title': '十、“天下无诈”的“中国行动”'}, {'id': '1823274968718254080', 'contentId': '1823271524825571328', 'title': '一、“成其身而天下成，治其身而天下治”'}, {'id': '1823274970962206720', 'contentId': '1823271524825571328', 'title': '二、勇于“亮剑”，把“利剑”磨得更光更亮'}, {'id': '1823274972526682112', 'contentId': '1823271524825571328', 'title': '三、筑牢国家秘密安全防线的法治“城墙”'}, {'id': '1823274974506393600', 'contentId': '1823271524825571328', 'title': '四、“靶向治理”的行政配方'}, {'id': '1823274976515465216', 'contentId': '1823271524825571328', 'title': '五、罚不当罪，则不如无罚'}, {'id': '1823274978449039360', 'contentId': '1823271524825571328', 'title': '六、“食为政首，粮安天下”'}, {'id': '1823274980449722368', 'contentId': '1823271524825571328', 'title': '七、高水平社会主义市场经济体制的“守护神”'}, {'id': '1823274982425239552', 'contentId': '1823271524825571328', 'title': '八、道路千万条，安全第一条'}, {'id': '1823274984509808640', 'contentId': '1823271524825571328', 'title': '九、以法之名，让爱无“碍”'}, {'id': '1823274986703429632', 'contentId': '1823271524825571328', 'title': '十、为党管“档”，为国守史'}, {'id': '1823274989698162688', 'contentId': '1823271524825571328', 'title': '十一、科技兴则民族兴，科技强则国家强'}, {'id': '1823275037882327040', 'contentId': '1823271524825571328', 'title': '一、善有善报，恶有恶报'}, {'id': '1823275048850432000', 'contentId': '1823271524825571328', 'title': '二、让孩子笑起来更好看'}, {'id': '1823275050767228928', 'contentId': '1823271524825571328', 'title': '三、“最严罚单”的司法逻辑'}, {'id': '1823275052889546752', 'contentId': '1823271524825571328', 'title': '四、司法保护生命尊严的判决创新'}, {'id': '1823275054680514560', 'contentId': '1823271524825571328', 'title': '五、现实版“药神”遇上司法温度'}, {'id': '1823275056526008320', 'contentId': '1823271524825571328', 'title': '六、“八项规定”：以“小切口”带来大变局'}, {'id': '1823275058488942592', 'contentId': '1823271524825571328', 'title': '七、“感情深，一口闷”的法律之问'}, {'id': '1823275060485431296', 'contentId': '1823271524825571328', 'title': '八、“虚拟数字人”来了，你准备好了吗？'}, {'id': '1823275062712606720', 'contentId': '1823271524825571328', 'title': '九、拯救“护寨神树”，司法在行动'}, {'id': '1823275064943976448', 'contentId': '1823271524825571328', 'title': '十、让劳动者更加有尊严'}, {'id': '1823296596378394624', 'contentId': '1823271524825571328', 'title': '十二、毒品一日不绝，禁毒一日不止'}, {'id': '1823296600887271424', 'contentId': '1823271524825571328', 'title': '十三、只有“进行时”，没有“完成时”'}]}
bawupufa_answer = [[{'1823889225604407296': 'A'}], [{'1823889368873443328': 'C'}], [{'1823889627888492544': 'B'}], [{'1823889834340524032': 'B'}], [{'1823890066851766272': 'B'}], [{'1823890250616807424': 'A'}], [{'1823894087872290816': 'C'}], [{'1823894349538140160': 'A,B,C'}], [{'1823896254335164416': 'A'}], [{'1823896790530793472': 'A'}], [{'1823897058785894400': 'A'}], [{'1823897221164179456': 'A'}], [{'1823897341377126400': 'A'}], [{'1823897481177473024': 'A'}], [{'1823897654146375680': 'C'}], [{'1823897868005548032': 'B'}], [{'1823898033726693376': 'C'}], [{'1823898246017196032': 'A'}], [{'1823898420588322816': 'C'}], [{'1823898682082205696': 'A'}], [{'1823898870867828736': 'C'}], [{'1823899051386478592': 'A,B,C'}], [{'1823899259587534848': 'C'}], [{'1823899553784406016': 'A,B,C'}], [{'1823899893976014848': 'A,B,C'}], [{'1823900348953141248': 'C'}], [{'1823901560339439616': 'A,B'}], [{'1823901708402565120': 'B'}], [{'1824000107206418432': 'C'}], [{'1824000547167936512': 'A'}], [{'1824000697378545664': 'A,B,C'}], [{'1824000850307063808': 'B'}], [{'1824001408355016704': 'B'}], [{'1824001569412096000': 'A,B'}], [{'1824001707585052672': 'A'}], [{'1824001881606725632': 'A,B'}], [{'1824002089501597696': 'B'}], [{'1824002217234931712': 'A'}], [{'1824002350949343232': 'B'}], [{'1824002515227648000': 'A,B,C'}], [{'1824002659222298624': 'B'}], [{'1824002776385986560': 'A'}], [{'1824001112094547968': 'A,B,C'}], [{'1824001281510875136': 'C'}],]

# 应知应会法律知识导读
yingzhiyinghui = {'objId':'1824032258543067136','bookName':'应知应会法律知识导读','chapter_content':[{'id': '1824032258555650048', 'contentId': '1824032258543067136', 'title': '以勤学党规国法促“应知应会”成“真知真会”'}, {'id': '1824032787767762944', 'contentId': '1824032258543067136', 'title': '目录'}, {'id': '1824035991163248640', 'contentId': '1824032258543067136', 'title': '一 法治理念编'}, {'id': '1824113852335267840', 'contentId': '1824032258543067136', 'title': '二 组织和作风建设编'}, {'id': '1824203892256153600', 'contentId': '1824032258543067136', 'title': '三 纪检监察编'}, {'id': '1824204419480166400', 'contentId': '1824032258543067136', 'title': '四 国家安全编'}, {'id': '1824204706269896704', 'contentId': '1824032258543067136', 'title': '五 民事行为编'}, {'id': '1824205156956250112', 'contentId': '1824032258543067136', 'title': '六 依法行政编'}, {'id': '1824206136011661312', 'contentId': '1824032258543067136', 'title': '七 犯罪防治编'}, {'id': '1824207258709401600', 'contentId': '1824032258543067136', 'title': '八 社会治理编'}, {'id': '1824208235122401280', 'contentId': '1824032258543067136', 'title': '九 乡村振兴编'}]}
yingzhiyinghui_answer = [
    [{'1824209661458391040': 'A'}, {'1824209861115650048': 'C'}],
    [{'1824210062559682560': 'B'}, {'1824210316927442944': 'C'}],
    [{'1824210489711796224': 'A'}, {'1824210601804570624': 'A,B,C'}],
    [{'1824210789822636032': 'B'}, {'1824210922165510144': 'A,B,C'}, {'1824211023223070720': 'A'}],
    [{'1824211144555896832': 'C'}, {'1824211249375748096': 'B'}],
    [{'1824211523653869568': 'A'}, {'1824211639781564416': 'A,B,C'}, {'1824211756785868800': 'A,B,C'}],
    [{'1824211921437466624': 'B'}, {'1824212080208650240': 'C'}],
    [{'1824212510997225472': 'A,B,C'}, {'1824212682800111616': 'C'}],
    [{'1824212815549833216': 'A'}, {'1824212960358178816': 'A,B,C'}],
]

# 2024省教育厅普法读本
jiaoyutingpufa = {'objId':'1824676086983696384','bookName':'2024省教育厅普法','chapter_content':[{'id': '1824676086996279296', 'contentId': '1824676086983696384', 'title': '1、中华人民共和国教育法'}, {'id': '1824677382826500096', 'contentId': '1824676086983696384', 'title': '2、中华人民共和国教师法'}, {'id': '1824678209553178624', 'contentId': '1824676086983696384', 'title': '3、中华人民共和国义务教育法'}, {'id': '1824678882080464896', 'contentId': '1824676086983696384', 'title': '4、中华人民共和国职业教育法'}, {'id': '1824679769209315328', 'contentId': '1824676086983696384', 'title': '5、中华人民共和国家庭教育促进法'}, {'id': '1824680359532437504', 'contentId': '1824676086983696384', 'title': '6、中华人民共和国未成年人保护法'}, {'id': '1824681324209774592', 'contentId': '1824676086983696384', 'title': '7、中华人民共和国预防未成年人犯罪法'}, {'id': '1824682008569192448', 'contentId': '1824676086983696384', 'title': '8、中华人民共和国民办教育促进法'}, {'id': '1824682479023300608', 'contentId': '1824676086983696384', 'title': '9、中华人民共和国国家通用语言文字法'}, {'id': '1824682815221932032', 'contentId': '1824676086983696384', 'title': '10、湖南省学校学生人身伤害事故预防和处理条例'}]}
jiaoyutingpufa_answer = [
    [{'1824688086056968192': 'D'}, {'1824689359359582208': 'A'}, {'1824689925187969024': 'A,B,C'}, {'1824693346053922816': 'A,B,C'}],
    [{'1824693739559329792': 'D'}, {'1824694266598793216': 'D'}, {'1824694882607833088': 'A,D'}, {'1824695242705608704': 'A,B,D'}],
    [{'1824695973261090816': 'C'}, {'1824696385431150592': 'D'}, {'1824696721034190848': 'C,D'}, {'1824697136584859648': 'A,C'}],
    [{'1824697668984643584': 'B'}, {'1824698074859053056': 'B'}, {'1824698471380164608': 'A,B,C,D'}, {'1824698813043974144': 'A,B,C'}],
    [{'1824700306820177920': 'B'}, {'1824700673393958912': 'D'}, {'1824701160310710272': 'A,B,C,D'}, {'1824701614163763200': 'A,B,C,D'}],
    [{'1824702208861544448': 'B'}, {'1824702634990247936': 'D'}, {'1824702983574659072': 'A,B,C,D'}, {'1824703374773198848': 'A,B,C,D'}],
    [{'1824704791244185600': 'B'}, {'1824705192232230912': 'D'}, {'1824706559520808960': 'A,B,C,D'}, {'1824707660689186816': 'A,B,C'}],
    [{'1824708358227107840': 'D'}, {'1824708750591664128': 'C'}, {'1824709109540200448': 'A,B,C,D'}, {'1824709534049902592': 'A,B,D'}],
    [{'1824709916700450816': 'A'}, {'1824710620685017088': 'C'}, {'1824711017805914112': 'A,B,C,D'}, {'1824711632195952640': 'A,C'}],
    [{'1824712163803013120': 'D'}, {'1824712563486629888': 'C'}, {'1824712976684294144': 'A,B,D'}, {'1824713450888110080': 'A,B,C,D'}],
]
header = {
    'Pragma': 'no-cache',
    'X-Requested-With': 'XMLHttpRequest',
    'Cookie': cookie,
    'User-Agent': 'Apifox/1.0.0 (https://apifox.com)',
    'Content-Type': 'application/json; charset=utf-8',
    'Accept': '*/*',
    'Host': 'hn.12348.gov.cn',
    'Connection': 'keep-alive'
}

'''
    获取每本书的问题，返回值类型为数组字典
    :param contentId:   普法书本的id
    :return chapterIds  获取每本书的章节Ids,eg: [{'1824209661458391040': ''}, {'1824209861115650048': ''}],
'''
def exctue(book:dict):
    for chapter in book["chapter_content"]:
        # 1. 获取questionId
        question_id = get_question_id(book["objId"],chapter["id"])
        print(question_id)

'''
    执行做答功能
    :param book 每本书
    :param answer 每本书的答案
'''
def excute2(book:dict,answer:list):
    objId = book["objId"]
    index = 0
    url = "http://hn.12348.gov.cn/fxmain/onlineanswer/ex"
    for list in answer:
        payload_list = []
        for item in list:
            for question_id,answer in item.items():
                flag = 1
                if answer is None:
                    continue
                if len(answer) > 1:
                    flag = 2
                payload_dict = {
                    'answerResult': answer,
                    'chapterId': book["chapter_content"][index]["id"],
                    'contentId': book["objId"],
                    'contentType': '2',
                    'flag': flag,
                    'questionId': question_id
                }
            payload_list.append(payload_dict)
        payload_list = f"{payload_list}"


        response = rq.post(url,payload_list,headers=header).json()
        if response["extend"]["result"][question_id] == "1":
            print(f"【{book['chapter_content'][index]['title']}】\t回答正确")
            pass

        else:
            print(f"【{book['chapter_content'][index]['title']}】\t回答错误,请检查原因,题目id:  {question_id}")
        index += 1
    print(f"{book['bookName']}\t做答完毕，如果出现错误，或者漏答。尝试多运行几次脚本即可")


'''
    获取每本书需要题目
    :param case_id  即obj_id
    :param chapter_id   每本书的章节id
    
'''
def get_question_id(obj_id:str,chapter_id:str) ->str:
    qid_list = []
    url = f"http://hn.12348.gov.cn/fxmain/onlineanswer/os?caseId={obj_id}&chapId={chapter_id}"
    html_content = rq.get(url,headers=header).text
    if len(html_content) > 0:
        soup = BeautifulSoup(html_content, 'html.parser')
        # 查找所有带有 "qid" 属性的 span 标签
        questions = soup.find_all('span', class_=['question', 'question2'])
        # 获取 qid 并返回列表字典形式
        # qid_list = [{"qid": q.get("qid")} for q in questions]
        qid_list = [{q.get("qid"): ''} for q in questions]
        # 输出结果
        print(qid_list)



if __name__ == "__main__":
    excute2(bawupufa,bawupufa_answer)
    excute2(yingzhiyinghui,yingzhiyinghui_answer)
    excute2(jiaoyutingpufa,jiaoyutingpufa_answer)
